（1）定义长度为n+1的数组，用于表示该下标值的数是否出现过；定义一个左指针，用于标记数组统计完后从哪开始去找最小正整数。遍历数组统计位于1-n之间的数，如果存在则数组对应位置标记为1，且如果和当前左指针相同，则左指针右移
（2）
int getMinNumber(int A[], int n) {
    int left = 1, count[n+1];
    // 将数组元素初始化为0
    for (int i = 0; i < n+1; i++) {
        count[i] = 0;
    }
    // 遍历数组
    for (int i = 0; i < n; i++) {
        // 只统计大小在1-n的元素
        if (A[i] <= 0 || A[i] > n) 
            continue;
        // 该数出现过，标记为1
        count[A[i]] = 1;
        // 如果当前左指针是当前数字，则右移左指针，并找到最小的未出现过的正整数
        if (left == A[i]) {
            left++;
            // 如果右移左指针后的值在统计表出现过，则继续右移
            while (count[left] == 1)
                left++;
        }
    }
    // 当前左指针的值就是最小正整数
    return left;
}
（3）
时间复杂度O（n），空间复杂度O（n）